tutorials/incompressible/simpleFoam/pitzDaily3Blocks/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p PCG
    {
        preconditioner
        {
            preconditioner DIC;
        }

        minIter          0;
        maxIter          2000;
        tolerance        1e-06;
        relTol           0.01;
    };
    U PBiCG
    {
        preconditioner
        {
            preconditioner DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0.1;
    };
    k PBiCG
    {
        preconditioner
        {
            preconditioner DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0.1;
    };
    epsilon PBiCG
    {
        preconditioner
        {
            preconditioner DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0.1;
    };
    R PBiCG
    {
        preconditioner
        {
            preconditioner DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0.1;
    };
    nuTilda PBiCG
    {
        preconditioner
        {
            preconditioner DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0.1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    R               0.7;
    nuTilda         0.7;
}

// ************************************************************************* //
